# Getting the Row which has the max value in groups using groupby

In [2]:
import numpy as np
import pandas as pd

In [2]:
import numpy as np
import pandas as pd2

In [3]:
df = pd.DataFrame({
'sp' : ['MM1', 'MM1', 'MM1', 'MM2', 'MM2', 'MM2', 'MM4', 'MM4','MM4'],
'mt' : ['S1', 'S1', 'S3', 'S3', 'S4', 'S4', 'S2', 'S2', 'S2'],
'val' : ['a', 'n', 'cb', 'mk', 'bg', 'dgb', 'rd', 'cb', 'uyi'],
'count' : [3,2,5,8,10,1,2,2,7]
})

In [4]:
df

   count  mt   sp  val
0      3  S1  MM1    a
1      2  S1  MM1    n
2      5  S3  MM1   cb
3      8  S3  MM2   mk
4     10  S4  MM2   bg
5      1  S4  MM2  dgb
6      2  S2  MM4   rd
7      2  S2  MM4   cb
8      7  S2  MM4  uyi

In [33]:
df.loc[df.groupby(["sp", "mt"])["count"].idxmax()]

   count  mt   sp  val
0      3  S1  MM1    a
2      5  S3  MM1   cb
3      8  S3  MM2   mk
4     10  S4  MM2   bg
8      7  S2  MM4  uyi

## Second Approach

In [34]:
idx = df.groupby(["sp", "mt"])['count'].transform(max) == df['count']

In [35]:
df[idx]

   count  mt   sp  val
0      3  S1  MM1    a
2      5  S3  MM1   cb
3      8  S3  MM2   mk
4     10  S4  MM2   bg
8      7  S2  MM4  uyi

## getting index of rows with max index value

In [48]:
indexes = list(df.groupby(["sp"])["count"].idxmax().values)
indexes

[2, 4, 8]

In [49]:
df.loc[indexes,'val'] = 100

In [5]:
df

   count  mt   sp  val
0      3  S1  MM1    a
1      2  S1  MM1    n
2      5  S3  MM1   cb
3      8  S3  MM2   mk
4     10  S4  MM2   bg
5      1  S4  MM2  dgb
6      2  S2  MM4   rd
7      2  S2  MM4   cb
8      7  S2  MM4  uyi

## group by general

In [6]:
df_Aggregated = df.groupby(['sp', 'mt'], as_index=True, sort=False).agg({
    'count': ['sum', 'min'],
    'val': ['count']}).reset_index()

df_Aggregated.columns = [' '.join(col).strip() for col in df_Aggregated.columns.values]
df_Aggregated

    sp  mt  count sum  count min  val count
0  MM1  S1          5          2          2
1  MM1  S3          5          5          1
2  MM2  S3          8          8          1
3  MM2  S4         11          1          2
4  MM4  S2         11          2          3